[
  {
    "version": "3.5.3",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/archive/v3.5.3.zip",
    "date": "2019-01-15T08:00:00+00:00",
    "notes": [
      "[Fixed] [Fixed] Fixed an error where the model id for the SproutSeo_Delete404 task may not exist"
    ]
  },
  {
    "version": "3.5.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/archive/v3.5.2.zip",
    "date": "2019-01-11T08:00:00+00:00",
    "notes": [
      "[Fixed] Optimized SproutSeo_Delete404 task"
    ]
  },
  {
     "version": "3.5.1",
     "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/archive/v3.5.1.zip",
     "date": "2018-09-14T08:00:00+00:00",
     "notes": [
       "[Improved] Improved support for PHP 7.2"
     ]
  },
  {
    "version": "3.5.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/archive/v3.5.0.zip",
    "date": "2018-07-28T08:00:00+00:00",
    "notes": [
      "[Improved] Moved release feed to Github"
    ]
  },
  {
    "version": "3.4.3",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2018-05-22T07:00:00+00:00",
    "notes": [
      "[Added] Added support for Element Metadata field in Sections that are not URL-Enabled"
    ]
  },
  {
    "version": "3.4.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2018-04-05T07:30:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where max description length was no taken in Element Metadata Field"
    ]
  },
  {
    "version": "3.4.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2018-04-03T07:00:00+00:00",
    "notes": [
      "[Improved] Updates description column types to handle longer Meta Description Lengths",
      "[Fixed] Fixed issue where Redirect Elements couldn&#039;t be edited"
    ]
  },
  {
    "version": "3.4.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2018-02-23T08:00:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where `maxMetaDescriptionLength` was not always respected"
    ]
  },
  {
    "version": "3.3.9",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-12-21T08:00:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where Global Metadata was being defined incorrectly"
    ]
  },
  {
    "version": "3.3.8",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-12-19T08:00:00+00:00",
    "notes": [
      "[Fixed] Fixed a bug that assumed some values exist when they may not exist"
    ]
  },
  {
    "version": "3.3.6",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-12-14T08:00:00+00:00",
    "notes": [
      "[Added] Added support for overriding Canonical URLs at Element Metadata field level",
      "[Added] Added support for Environment Variables in Canonical URL override field",
      "[Added] Added support for Environment Variables in Globals Name and Description settings",
      "[Added] Added a new `maxMetaDescriptionLength` config setting to update the max length of a meta description",
      "[Added] Added validation to Redirects to ensure Old URL&#039;s are unique",
      "[Improved] Improved display of long URLs on the redirects index page"
    ]
  },
  {
    "version": "3.3.5",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-10-18T15:45:53+00:00",
    "notes": [
      "[Added] Added `craft.sproutSeo.getGlobals` to easily access all Global Metadata in tempaltes",
      "[Added] Added support for Rich Text fields in Description and Keyword Element Metadata field settings",
      "[Fixed] Fixed bug when section handles used camelCase",
      "[Fixed] Fixed bug when creating a dynamic sitemap if a section had been deleted"
    ]
  },
  {
    "version": "3.3.4",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-09-12T07:00:00+00:00",
    "notes": [
      "# Dynamic XML Sitemaps",
      "[Added] Added Dynamic XML Sitemaps for all URL-Enabled Sections including Entries, Categories, and Craft Commerce Products",
      "[Added] Added _Enable Dynamic Sitemaps_ setting. Dynamic Sitemaps will default to disabled if you are updating and will default to enabled for new installations.",
      "[Added] Added _Total Elements Per Sitemap_ setting. Adjust the total elements per sitemap to facilitate managing large sitemaps, multilingual sitemaps, and sitemaps on servers with limited resources. Default: 500.",
      "# 404 Redirect Elements",
      "[Added] Added 404 Redirect Element Type. Page Not Found errors can now be logged in your database, monitored, and updated to active Redirects by content admins.",
      "[Added] Added _Log 404 Redirects_ setting. Default: disabled.",
      "[Added] Added _404 Redirect Limit_ setting. Automatically purge the least recently updated 404 redirects from your database. Default: 500.",
      "# Misc",
      "[Added] Added Redirect count which keeps track of the number of times a Redirect or 404 is triggered.",
      "[Improved] Updated Custom Sections to support URLs for Sitemaps",
      "[Fixed] Fixed bug where Price Range Structured Data attribute displayed for more than &quot;Local Business&quot; metadata",
      "[Fixed] Fixed bug where field label SEO badge could display twice for custom patterns using the same custom variable in multiple settings",
      "[Fixed] Fixed bug where Redirects did not match UTF-8 characters in URLs"
    ]
  },
  {
    "version": "3.2.3",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-07-19T07:00:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where the Website Identity image did not get removed after the image was deleted from Assets",
      "[Fixed] Fixed bug where the Element Metadata field caused an error when an Element did not have URLs enabled",
      "[Fixed] Fixed bug where `CommerceProductUrlEnabledSectionType` integration would throw error  when ResaveElement task was triggered"
    ]
  },
  {
    "version": "3.2.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-06-20T07:00:00+00:00",
    "notes": [
      "[Added] Added error message when templates use the deprecated `optimize` tag in templates",
      "[Fixed] Fixed bug where append title could not be updated",
      "[Fixed] Fixed bug where saving Section Metadata via the Sitemap tab saved incorrect handle value",
      "[Fixed] Fixed bug where ogLocale didn&#039;t always use the correct locale",
      "[Fixed] Improved support for compatibility with PHP 5.4 and lower"
    ]
  },
  {
    "version": "3.2.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-03-29T07:00:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where Open Graph Image and Twitter Image could not be saved within Element Metadata Meta Details fields",
      "[Fixed] Fixed bug where canonical URL could default to the siteUrl in certain scenarios"
    ]
  },
  {
    "version": "3.2.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2017-03-13T07:00:00+00:00",
    "notes": [
      "# Structured Data",
      "[Added] Added support for Structured Data for Globals, Sections, and Element Metadata. Structured Data can be mapped to all supported Element Types such as Entries, Categories, Craft Commerce Products, and Sprout Email Campaign Emails. Basic schemas are provided for Creative Work, Event, Intangible, Organization, Person, Place, and Product data types and a flexible Schema API is provided for advanced mapping.",
      "[Added] Added support for Globals to generate Structured Data for Organization, Website, and Place schema mappings",
      "[Added] Added support for Main Entity of Page Structured Data for Sections and Element Metadata",
      "[Added] Added Structured Data Schema API",
      "# Globals",
      "[Added] Added Globals section to manage Knowledge Graph metadata and Structured Data",
      "[Added] Added Globals section to manage Verify Ownership tags",
      "[Added] Added Globals section to manage Social Profiles",
      "[Added] Added Globals section to manage Contact numbers",
      "[Added] Added support for Organization Website Identity schema",
      "[Added] Added Founding Date, Opening Hours, and Price Range for Local Business Schema",
      "[Added] Added support for Person Website Identity schema",
      "[Added] Added support for Gender in Person Website Identity schema: Male, Female, Custom",
      "[Added] Added Globals Address Field that supports over 200 address formats",
      "[Added] Added option to query Longitude and Latitude for an address via the Google Maps API",
      "[Added] Added craft.sproutSeo.contacts tag",
      "[Added] Added craft.sproutSeo.socialProfiles tag",
      "[Added] Added support for Append Site Name setting to be set to a custom value",
      "[Added] Added support for SEO Divider setting to be set to a custom value",
      "[Added] Added support to supress the global Title value from being added to the home page title metadata",
      "[Added] Added support for Google+ in publisher meta",
      "[Added] Added support for using {siteUrl} in Globals URL setting",
      "[Added] Added option to apply default image transforms to Open Graph and Twitter Card image metadata",
      "[Added] Added default transform options for Open Graph and Twitter Cards for common Rectangle and Square sizes",
      "[Improved] Renamed Defaults to Globals",
      "[Improved] Removed Global Fallback meta data option. The Globals section will now serve as the Global Fallback.",
      "# URL-Enabled Sections",
      "[Added] Added URL-Enabled Sections and support for Entries, Categories, and Craft Commerce Products. URL-Enabled Sections facilitate the process of prioritizing metadata, mapping Structured Data, and generating XML sitemaps for all URL-Enabled Element Types.",
      "[Added] Added URL-Enabled Section API",
      "[Added] Added Custom Sections",
      "[Added] Added Active Metadata icons in the UI which indicate if a Section is setup to use an Element Metadata fieldtype, is included in the XML Sitemap, and supports fallback metadata for Search and Social Sharing",
      "[Added] Added support to resave all affected elements when an Entry Type or Category Group Field Layout are saved",
      "[Added] Added support to resave all affected elements after saving the Element Metadata field",
      "[Improved] The `craft.sproutSeo.meta` tag `default` attribute has been deprecated. Use the `section` attribute instead.",
      "[Improved] The `craft.sproutSeo.meta` tag `id` attribute has been deprecated. Use the Element Metadata field instead.",
      "# Element Metadata Field",
      "[Added] Added Element Metadata Field",
      "[Added] Added support to set default Title, Description, Image, and Keyword values based on existing fields",
      "[Added] Added support to set dynamic Title, Description, Image, and Keyword values based on existing fields",
      "[Added] Added support for users to manage metadata manually via Custom Fields (for Title, Description, Image, Keywords, and Main Entity Structured Data) or Meta Details blocks (for more comprehensive Search, Open Graph, Twitter Card, Geo, and Robots metadata)",
      "[Added] Added counters to Title and Description fields, including when selected as dynamic settings",
      "[Added] Added support to generate Keywords dynamically",
      "[Added] Added support to display an SEO badge in the Field Layout that indicates if a field is mapped to be used for SEO and provides additional info on the field&#039;s scope and level of priority",
      "[Added] Added support to display a SEO badge on SEO-enabled fields using &#039;Add Custom Format&#039; setting",
      "[Added] Added IPreviewableFieldtype support to display a status of the Element Metadata field in Element Index columns",
      "[Added] Added support for the Element Metadata field to be marked as required when settings use custom Meta fields via the &quot;Display Editable Field&quot; setting",
      "[Improved] Removed Sprout SEO 2 Meta Fields (Meta Basic, Meta Open Graph, Meta Twitter Card, Meta Geo, Meta Robots) in favor of new Element Metadata field",
      "[Improved] Added a migration for the deprecated Twitter Photo Card to be migrated to use Summary Card with Large Image",
      "[Fixed] Fixed bug where metadata values would not be saved with Entry Drafts",
      "[Fixed] Fixed bug where metadata values were not repopulated if field was required",
      "# Misc",
      "[Added] Added the `{% sproutseo &#039;optimize&#039; %}` tag, a more powerful way to manage Meta Tags and Structured Data in templates.",
      "[Added] Added Advanced setting to disable metadata rendering",
      "[Added] Added Advanced setting to enabled a custom `metadata` variable, and choose the variable name",
      "[Added] Added Advanced setting to disable Sitemap Custom Sections option and simplify UI",
      "[Added] Added Advanced setting to disable Meta Details options and simplify UI",
      "[Added] Added Advanced setting to update locale behavior if locales are being used for multi-site",
      "[Added] Added Advanced setting to optionally display field handles in Element Metadata field dropdowns",
      "[Added] Added support for Sprout Import import SEO data into all metadata fields",
      "[Improved] Redirects have been optimized to only get triggered if a request 404s",
      "[Improved] Updated string values output in metadata to clean up any leading or trailing whitespace",
      "[Improved] The `craft.sproutSeo.optimize()` tag has been deprecated. Use `{% sproutseo &#039;optimize&#039; %}`.",
      "[Fixed] Fixed bug with Sprout Import Redirect Element integration"
    ]
  },
  {
    "version": "2.2.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2016-10-20T12:31:05+00:00",
    "notes": [
      "[Fixed] Fixed a bug where some Open Graph meta values could cause a validation error",
      "[Fixed] Fixed a bug where plugin would block yiic commands",
      "[Fixed] Fixed a bug where sitemap integrations could cause an error by returning null or empty"
    ]
  },
  {
    "version": "2.2.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2016-04-20T09:30:00+00:00",
    "notes": [
      "[Fixed] Fixed bug where the Meta Field Types would not display saved values on Craft Commerce Products",
      "[Fixed] Fixed migration error that could occur on older versions of MySQL",
      "[Fixed] Fixed deprecation error introduced in Craft 2.6.2779"
    ]
  },
  {
    "version": "2.2.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2016-03-29T17:00:00+00:00",
    "notes": [
      "[Added] Added Sitemap support for Categories",
      "[Added] Added Sitemap support for Craft Commerce Products",
      "[Added] Added sitemap integration support for third-party URL-enabled Elements using registerSproutSeoSitemap hook",
      "[Fixed] Fixed issue that could occur if somebody enabled a Section in the sitemap and then disabled URLs on that Section",
      "[Fixed] Fixed error that could occur when trying to save the Sitemap settings using the save shortcut command"
    ]
  },
  {
    "version": "2.1.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2016-03-03T17:00:00+00:00",
    "notes": [
      "[Added] Added PHP 7 compatibility",
      "[Improved] Updated Facebook locale to default to blank",
      "[Fixed] Fixed error that could occur if an image used in the SEO settings was independently deleted in Craft",
      "[Fixed] Fixed bug where updating some settings could break other settings"
    ]
  },
  {
    "version": "2.1.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2016-02-04T08:00:00+00:00",
    "notes": [
      "[Added] Redirects can now be reordered",
      "[Improved] Optimized database queries for determining if a redirect is necessary",
      "[Fixed] Updated SproutSeo_MetaModel id value to default to null to fix an error that could occur when saving to some MySQL databases"
    ]
  },
  {
    "version": "2.0.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-12-02T08:00:00+00:00",
    "notes": [
      "# General",
      "[Added] The entire Control Panel has been updated to work with Craft 2.5",
      "[Added] Added Plugin icon",
      "[Added] Added Plugin description",
      "[Added] Added link to documentation",
      "[Added] Added link to plugin settings",
      "[Added] Added link to release feed",
      "[Added] Added subnav in place of tabs for top level navigation",
      "[Added] Added Sprout Migrate support for Redirect Element Type",
      "[Improved] Improved and standardized display of Sprout plugin info in footer",
      "[Improved] Improved and simplified breadcrumbs",
      "[Improved] Settings pages use sidebar in place of tabs",
      "# Redirects",
      "[Added] Added status setting to Redirect form",
      "[Improved] Updated Redirect status and delete settings to appear before sidebar documentation",
      "# Meta",
      "[Fixed] Fixed global fallback setting display"
    ]
  },
  {
    "version": "1.1.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-09-16T13:56:00+00:00",
    "notes": [
      "[Added] Adds CSRF support on Redirect forms",
      "[Improved] Updates the Redirect Method field to be required",
      "[Improved] Updates Redirect statuses from on/off to enabled/disabled",
      "[Improved] Removes the option to sort by Test column on Redirect Element Index page"
    ]
  },
  {
    "version": "1.1.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-09-14T13:56:00+00:00",
    "notes": [
      "[Added] Added Redirect Element Type and the ability to create and manage 301 and 302 redirects",
      "[Added] Redirect Elements with regular expressions and capture groups",
      "[Added] Redirect Elements can be Enabled or Disabled",
      "[Added] Added bulk actions to update redirect methods and delete Redirect Elements",
      "[Improved] Improved a subset of internal APIs for better performance",
      "[Improved] Improved some UI elements and copy throughout the control panel",
      "[Fixed] Fixes an output issue for the robots meta tag"
    ]
  },
  {
    "version": "1.0.5",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-08-04T07:00:00+00:00",
    "notes": [
      "[Added] Added craft.sproutSeo.getOptimizedMeta tag. Optimized meta data can now be customized in template.",
      "[Added] Added craft.sproutSeo.getDefaultByHandle tag",
      "[Added] Added craft.sproutSeo.divider tag",
      "[Added] Added SproutSeo_MetaDefaultsService",
      "[Added] Added SproutSeo_MetaDefaultsService",
      "[Added] Added several variables and methods to SproutSeo_MetaModel: locale, setMeta, getMetaTagName, getMetaTagData, getEntryOverride, getCodeOverride, getDefault, getGlobalFallback",
      "[Improved] Added SproutSeoMetaHelper and moves several helper methods into this class",
      "[Improved] Updated robots checkboxes to use Craft form macros",
      "[Improved] Updates prepareGeoPosition() method to return the default position if nothing better is found",
      "[Improved] Added all og:image attributes to SproutSeo_OpenGraphFieldModel",
      "[Improved] Improved error messaging and default behavior of ogImageSecure value in environments using SSL",
      "[Improved] Renames curiously titled SproutSeo_MetaService::getDefaultByDefaultHandle() =&gt; SproutSeo_MetaService::getDefaultByHandle()",
      "[Improved] Renames SproutSeo_MetaService::_prioritizeMetaValues() =&gt; SproutSeo_MetaService::getOptimizedMeta()",
      "[Improved] Various code cleanup and improvements",
      "[Fixed] Fixed behavior of SproutSeoMetaHelper::prepareAssetUrls()",
      "[Fixed] Fixed behavior of SproutSeo_MetaService::prepareAppendedSiteName()",
      "[Fixed] Fixed bug in how several Meta Field Types were re-populating their data in their fields",
      "[Fixed] Removes data-saveshortcut behavior from Sitemap index"
    ]
  },
  {
    "version": "1.0.3",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-06-24T21:24:00+00:00",
    "notes": [
      "[Fixed] Fixed bug when saving Meta Fields without Robots Meta Field present"
    ]
  },
  {
    "version": "1.0.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-06-23T18:18:00+00:00",
    "notes": [
      "[Improved] Improved image override error messaging",
      "[Improved] Improved migration logic",
      "[Fixed] Fixed several issues with Meta Fields not saving properly under certain conditions"
    ]
  },
  {
    "version": "1.0.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-05-13T07:00:00+00:00",
    "notes": [
      "[Added] Commercial Release"
    ]
  },
  {
    "version": "0.9.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-05-11T21:00:00+00:00",
    "notes": [
      "[Added] Meta Field Types now support multi-lingual content",
      "[Improved] Updated SEO Default titles to display name of Default",
      "[Improved] Added logic to prevent a situation where a Section with URLs-enabled and null URLs could appear in the Sitemap output",
      "[Fixed] Fixed but where locale ID was being output twice in some URLs",
      "[Fixed] Fixes twitter:card `summary_large_image` meta content value"
    ]
  },
  {
    "version": "0.9.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2015-04-07T16:00:00+00:00",
    "notes": [
      "[Added] Added support for multi-language sitemaps",
      "[Added] Added support for images using Amazon S3",
      "[Added] Added support for overriding images",
      "[Added] Added support for environmentVariables in SEO Defaults, Field Types, and Sitemap Custom Pages",
      "[Added] Added support for CSRF Protection",
      "[Added] The `getSitemap()` tag can optionally just return &lt;url&gt; nodes",
      "[Added] Added example US English translation file",
      "[Added] Added character countdown to several fields that have recommended character limits",
      "[Improved] Removes deprecated &#039;template&#039; option in favor of &#039;default&#039; to reference Defaults by handle",
      "[Improved] Allow Defaults to override Append Site Name setting",
      "[Improved] Added Home icon to identify which Default is selected as the Global Fallback",
      "[Improved] Robots meta tags now output as positive by default",
      "[Improved] Sitemap now only displays live entries",
      "[Improved] Improved field management between Defaults and Meta Field Types",
      "[Improved] Improved formatting, code hinting, and doc blocks",
      "[Improved] Various UI updates and copy tweaks",
      "[Fixed] Fixed error when duplicating an entry with a Meta Fields",
      "[Fixed] Fixed bug where geo fields might not be included in meta tags",
      "[Fixed] Fixed various bugs with Robots checkboxes",
      "[Fixed] Fixed call to deprecated method in Robots Field"
    ]
  },
  {
    "version": "0.8.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2014-10-16T09:12:00+00:00",
    "notes": [
      "[Added] Added support for absolute Twitter and Open Graph Asset paths",
      "[Fixed] Fixed issue where social field types could cause ResaveElements task to hang"
    ]
  },
  {
    "version": "0.8.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2014-09-29T15:13:00+00:00",
    "notes": [
      "[Fixed] Updated date format for &lt;lastmod&gt; tag to be ISO 8601 compliant",
      "[Fixed] Fixed bug that prevented user from editing a Custom Page URL"
    ]
  },
  {
    "version": "0.8.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2014-09-14T07:00:00+00:00",
    "notes": [
      "[Added] Create and generate an XML Sitemap from your Sections with URLs",
      "[Added] Add Sitemap Pages based on custom URLs",
      "[Added] Add support for multiple Twitter Cards (Summary Card, Summary Card with Large Image, Player Card, Photo Card)",
      "[Added] Add support for multiple Facebook Open Graph types (Article, Website)",
      "[Added] Twitter and Open Graph images are now integrated with Assets",
      "[Added] Added Meta: Twitter Card field type",
      "[Added] Added Meta: Open Graph field type",
      "[Added] Added option to select global Default",
      "[Added] Special characters are now escaped when output",
      "[Added] Added framework for unit testing",
      "[Improved] Updated `optimize()` tag to be more optimal",
      "[Improved] Updated &quot;Fallbacks&quot; to be named &quot;Defaults&quot;",
      "[Improved] Moved default plugin settings to the settings tab in the plugin",
      "[Improved] Removed custom Global Fallback option",
      "[Improved] Moved option to append sitename from global level to the Default level",
      "[Improved] Improved organization of code",
      "[Improved] Various minor code and UI improvements",
      "[Improved] Updated Robots syntax to use a string instead of an array",
      "[Fixed] Fixed Robots Checkbox settings to now save properly"
    ]
  },
  {
    "version": "0.6.2",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2014-03-25T14:48:00+00:00",
    "notes": [
      "[Fixed] Fixed output of Custom Global Value setting"
    ]
  },
  {
    "version": "0.6.1",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2014-03-18T12:20:00+00:00",
    "notes": [
      "[Added] Added craft.sproutSeo.optimize() variable",
      "[Added] Deprecated craft.sproutSeo.define() variable",
      "[Fixed] Fixed bug preventing override fields from saving on more recent versions of Craft",
      "[Fixed] Fixed bug preventing fallback templates to be deleted on more recent versions of Craft"
    ]
  },
  {
    "version": "0.6.0",
    "downloadUrl": "https://github.com/barrelstrength/craft-sprout-seo/releases",
    "date": "2013-12-29T21:22:00+00:00",
    "notes": [
      "[Added] Private Beta"
    ]
  }
]
